In [ ]:
import pandas as pd

In [16]:
df=pd.read_csv("messy_daily_water_consumption.csv")
df.head()

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters
0,2025-#2-11,P0015,58.0,Male,NaN,18.3,Medium,2.14
1,2025-0@-31,P000@,54.0,NaN,Rawalpindi,41.9,High,4.01
2,2025-08-17,P0053,27.0,Femaye,Karachi,22.1,High,2.76
3,2025-12-29,y0035,51.0,Male,Rawalpindi,40.8,Medium,3.35
4,2025-06-13,P0069,46.0,Fema#e,NaN,33.5,Low,2.30

In [17]:
df.tail()

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters
36500,2025-04-27,P0054,55.0,NaN,Rawalpindi,16.9,Medium,2.18
36501,2z25-06-29,P0074,53.0,Fzmale,Karachi,35.2,Low,2.66
36502,2025-09z07,P0087,42.0,Male,Multan,39.7,Medium,3.14
36503,2025-06-14,P0100,55.0,Male,NaN,27.5,Medium,2.75
36504,2025-08-08,P0007,58.0,Female,Islamabad,31.4,Low,2.35

In [18]:
print('rows: ', df.shape[0])
print('columns: ', df.shape[1])

rows:  36505
columns:  8

In [20]:
df.isnull().sum()

Date                     3651
Person_ID                3652
Age                      3651
Gender                   3651
City                     3651
Temperature_C            3650
Activity_Level           3650
Water_Consumed_Liters    3650
dtype: int64

In [23]:
df = df.fillna(df.median)

In [24]:
df.isnull().sum()

Date                     0
Person_ID                0
Age                      0
Gender                   0
City                     0
Temperature_C            0
Activity_Level           0
Water_Consumed_Liters    0
dtype: int64

In [26]:
df.dtypes

Date                     object
Person_ID                object
Age                      object
Gender                   object
City                     object
Temperature_C            object
Activity_Level           object
Water_Consumed_Liters    object
dtype: object